import re
from collections import Counter
import requests
from selenium import webdriver
from selenium.webdriver.common.by import By
from urllib.parse import urlparse
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC


def collect_keywords(start_url):
    try:
        driver = webdriver.Chrome()
        driver.get(start_url)
        WebDriverWait(driver, 30).until(EC.presence_of_element_located((By.TAG_NAME, 'html')))
        
        # 페이지 소스 가져오기
        html = driver.page_source
        # res = requests.get(start_url)
        # html = res.text
        # print(html)
            
        # HTML에서 한글 텍스트를 추출하는 정규표현식
        korean_pattern = re.compile('[가-힣]+')

        # 정규표현식을 사용하여 한글 텍스트 추출
        korean_text = korean_pattern.findall(html)

        word_counts = Counter(korean_text)
        driver.quit()
        return word_counts
    
    except requests.exceptions.RequestException as e:
        print(f"Failed to get HTML from {start_url}: {e}")
        return Counter()  # 빈 Counter 객체 반환
    
    except Exception as e:
        print(f"An error occurred with {start_url}: {e}")
        return Counter()  # 빈 Counter 객체 반환


# 동일한 도메인 _ request
# kw : Counter()
# kw : Counter({'링크짱': 4})
# kw : Counter({'링크짱': 4})
# kw : Counter()
# kw : Counter()
# kw : Counter()

#동일한 도메인 _ selenium
# kw : Counter({'입력해': 23, '주세요': 23, '가능합니다': 15, '출금': 9, '사용하실': 9, '입력이': 9, '접근에러': 8, '인증': 7, '비밀번호를': 7, '숫자': 7, '비밀번호는': 7, '까지만': 7, '비밀번호': 6, '입력': 6, '알뜰폰': 6, '정확하게': 6, '아이디': 5, '연락처': 5, '인증번호': 5, '수': 5, '자': 5, '닉네임': 4, '국민은행': 4, '하나은행': 4, '신한은행': 4, '기업 은행': 4, '농협': 4, '신협': 4, '수협': 4, '우체국': 4, '카카오뱅크': 4, '새마을금고': 4, '도이치은행': 4, '광주은행': 4, '산업은행': 4, '경남은행': 4, '부산은행': 4, '대구은행': 4, '전북은행': 4, '제주은행': 4, '은행': 4, '제일은행': 4, '한국씨티은행': 4, '입력하신': 4, '없습니다': 4, '조합': 4, '한글': 4, '받으실': 4, '번호를': 4, '포인트': 3, '드리는': 3, '완료': 3, '가입하기': 3, '확인': 3, '선택': 3, '전송': 3, '아이디를': 3, '연락처를': 3, '바랍니다': 3, '인증번호가': 3, '지급': 2, '매일': 2, '베팅금의': 2, '적립': 2, '이용': 2, '밀어서': 2, '보안해제': 2, '실패': 2, '코드': 2, '후': 2, '예금주': 2, '은행명': 2, '계좌번호': 2, '환영합니다': 2, '오신': 2, '아이디는': 2, '영문': 2, '글자만': 2, '닉네임을': 2, '정확히': 2, '정확한': 2, '입력해주시길': 2, '공백없이': 2, '영어와': 2, '숫자로만': 2, '계좌번호를': 2, '계좌번호는': 2, '숫자와': 2, '만을': 2, '사용해서': 2, '입력해주세요': 2, '예금주를': 2, '은행명을': 2, '닉네임은': 2, '자까지만': 2, '발송': 2, '되었습니다': 2, '모바일로': 1, '접속하셨습니다': 1, '모바일': 1, '전용': 1, '페이지로': 1, '이동합니다': 1, '주말': 1, '매': 1, '충전': 1, '평일에는': 1, '상시': 1, '입금': 1, '옵션': 1, '추가': 1, '당일': 1, '내역이': 1, '있어도': 1, '쉬지': 1, '않고': 1, '티켓': 1, '및': 1, '상품': 1, '으로': 1, '전환': 1, '게시판': 1, '위': 1, '혜택들이': 1, '모두': 1, '중복': 1, '게임존': 1, '월요': 1, '롤링데이': 1, '롤링': 1, '없는': 1, '자유로운': 1, '월요일이': 1, '아닌': 1, '날에는': 1, '핼프': 1, '로그인': 1, '잊으셨나요': 1, '회원': 1, '또는': 1, '문의': 1, '하기': 1, '계정이': 1, '없으신가요': 1, '주소찾기': 1, '둘러': 1, '보기는': 1, '최소한의': 1, '정보': 1, '통신사': 1, '가': 1, '입': 1, '하': 1, '기': 1, '정회원': 1, '접속': 1, '처음': 1, '회원님께': 1, '혜택을': 1, '확인하세요': 1, '오랜': 1, '기간': 1, '동안': 1, '신뢰와': 1, '보안을': 1, '최우선으로': 1, '운영되고': 1, '있으며': 1, '언제나': 1, '만족하실': 1, '있는': 1, '사이트가': 1, '될': 1, '것입니다': 1, '에': 1, '것을': 1, '가입': 1, '회원님의': 1, '추천인': 1, '코드를': 1, '잠금해제': 1, '로그인이': 1, '회원가입이': 1, '정상적으로': 1, '됐습니다': 1, '전화번호가': 1, '정확하지': 1, '않습니다': 1, '이동통신사 업자에게': 1, '전달되었습니다': 1, '발송되었습니다': 1, '자리를': 1, '입력하여': 1, '주시기': 1, '전송을': 1, '실패하였습니다': 1})
# kw : Counter({'에볼루션': 28, '게이밍': 27, '제공': 26, '주세요': 23, '입력해': 22, '가능합니다': 13, '룰렛': 10, '프라그마틱': 9, '숫자': 8, '접근에러': 8, '사용하실': 8, '입력이': 8, '수': 7, '비밀번호': 7, '확인': 7, '출금': 7, '파트너': 7, '다양한': 6, '알뜰폰': 6, '비밀번호는': 6, '까지만': 6, '정확하게': 6, '콤프함': 6, '아이디': 5, '입력': 5, '연락처': 5, '자': 5, '비밀번호를': 5, '프로모션': 5, '있습니다': 4, '국민은행': 4, '우리은행': 4, '신한은행': 4, '하나은행': 4, '기업은행': 4, '산업은행': 4, '제일은행': 4, '씨티은행': 4, '농협': 4, '신협': 4, '수협': 4, '우체국': 4, '새마을': 4, '케이뱅크': 4, '카카오뱅크': 4, '광주은행': 4, '경남은행': 4, '부산은행': 4, '대구은행': 4, '전북은행': 4, '제주은행': 4, '문의': 4, '입력하신': 4, '없습니다': 4, '조합': 4, '한글': 4, '완료': 4, '인증': 4, '받으실': 4, '번호를': 4, '입금신청': 4, '출금신청': 4, '바카라': 4, '고객센터': 4, '최대': 4, '매주': 4, '헥소게이밍': 4, '후': 3, '닉네임': 3, '예금주': 3, '아이디는': 3, '영문': 3, '선택': 3, '인증번호': 3, '전송': 3, '아이디를': 3, '연락처를': 3, '바랍니다': 3, '인증번호가': 3, '되었습니다': 3, '머니전환': 3, '카지노': 3, '코리안': 3, '딜러': 3, '살롱': 3, '블랙잭': 3, '게임쇼': 3, '인기슬롯': 3, '프리스핀': 3, '이용메뉴': 3, '메세지': 3, '이벤 트': 3, '마이크로': 3, '노리밋시티': 3, '안내': 3, '서비스를': 3, '시': 2, '로그인': 2, '회원가입': 2, '코드': 2, '이용': 2, '통신사': 2, '은행명': 2, '계좌번호': 2, '접속': 2, '글자만': 2, '닉네임을': 2, '정확히': 2, '정확한': 2, '입력해주시길': 2, '공백없이': 2, '영어와': 2, '숫자로만': 2, '계좌번호를': 2, '계좌번호는': 2, '숫자와': 2, '만을': 2, '사용해서': 2, '입력해주세요': 2, '예금주를': 2, '은행명을': 2, '닉네임은': 2, '자까지만': 2, '정상적으로': 2, '됐습니다': 2, '발송': 2, '코인': 2, '메가웨이': 2, '호텔카지노': 2, '마일리지': 2, '지인추천': 2, '추천보기': 2, '마이페이지': 2, '쿠폰함': 2, '공지사항': 2, '전': 2, '종목에서': 2, '베팅금의': 2, '실시간으로': 2, '지급': 2, '혜택을': 2, '누려보세요': 2, ' 금': 2, '토': 2, '일': 2, '첫': 2, '충전': 2, '등급별로': 2, '혜택': 2, '진행되는': 2, '레드타이거': 2, '와즈단': 2, '준비중': 2, '실시간': 2, '입금': 2, '유의사항': 2, '및': 2, ' 크레이지': 2, '슬롯': 2, '통해': 2, '독점': 2, '빠른': 2, '개씨발': 1, '브라우저': 1, '크기가': 1, '변할': 1, '동적으로': 1, '사이즈를': 1, '조절해야': 1, '하는경우': 1, '모바일': 1, '접속방법': 1, '하신': 1, '후에': 1, '이용하세요': 1, '게임을': 1, '즐기실': 1, '로그인이': 1, '되시지': 1, '않는다면': 1, '둘러': 1, '보기는': 1, '최소한의': 1, '정보': 1, '포 함': 1, '이내': 1, '가': 1, '입': 1, '하': 1, '기': 1, '또는': 1, '하기': 1, '정회원': 1, '가입하기': 1, '회원님의': 1, '추천인': 1, '코드를': 1, '회원가입이': 1, '전화번호가': 1, '정확하지': 1, '않습니다': 1, '이동통신사업자에게': 1, '전달되었습니다': 1, '발송되었습니다': 1, '자리를': 1, '입력하여': 1, '주시기': 1, '전송을': 1, '실패하였습니다': 1, '출금랭 킹': 1, '고객상담': 1, '운영팀': 1, '입니다': 1, '머니': 1, '이동이': 1, '불가': 1, '고객센터로': 1, '전환이': 1, '코리안딜러': 1, '티비쇼게임': 1, '메가웨이즈': 1, '회': 1, '스토 어': 1, '로그아웃': 1, '일대일문의': 1, '도착': 1, '건': 1, '답변': 1, '아시아': 1, '씨큐나인': 1, '베가스': 1, '타이산': 1, '섹시게이밍': 1, '게임플레이': 1, '드림게이밍': 1, '비 보': 1, '비비아이엔': 1, '오리엔탈': 1, '올벳': 1, '릴렉스게이밍': 1, '판타즈마': 1, '플레이엔고': 1, '회원정보': 1, '업데이트': 1, '쿠폰': 1, '콤프': 1, '사용': 1, '규정': 1, '회 원': 1, '롤링': 1, '관련': 1, '주의사항': 1, '슬롯게임': 1, '양방베팅': 1, '근절': 1, '파워볼': 1, '파친코': 1, '레드': 1, '도어': 1, '펑키': 1, '타임': 1, '플립': 1, '프렌치': 1, '골드': 1, '라이트닝': 1, '이머지브': 1, '오토': 1, '인기': 1, '메가': 1, '웨이': 1, '홀짝': 1, '워게임': 1, '원카드': 1, '프리드로우': 1, '홈런더비': 1, '사커슈팅': 1, '유로컵': 1, '프리미어': 1, '슈퍼리그': 1, '월드컵': 1, '골든힐파크': 1, '힐사이드파크': 1, '베넷트파크': 1, '전문적인': 1, '라이브': 1, '여종의': 1, '등': 1, '완벽하고': 1, '에서': 1, '만나 보세요': 1, '안전한': 1, '유니크': 1, '개발': 1, '기술을': 1, '암호화': 1, '기술과': 1, '보안': 1, '시스템으로가장': 1, '중요한': 1, '고객': 1, '자금을': 1, '철저히': 1, '보안되어': 1, '저희': 1, '사이트에서': 1, '제공하는': 1, '마음': 1, '것': 1, '즐기': 1, '실': 1, '편리한': 1, '마켓을': 1, '선도하는': 1, '기술로': 1, '자체': 1, '개발을': 1, '페이지': 1, '외에': 1, '양대': 1, '마켓플렛폼인': 1, '와': 1, '원생': 1, '시스템에서': 1, '도': 1, '편의하게': 1, '즐길': 1, '안정적인': 1, '동시에': 1, '최첨단': 1, '금융': 1, '시스템을': 1, '도입하여': 1, '가장': 1, '입출금': 1, '제공하고': 1, '있으며': 1, '최고의': 1, '게임환경을': 1, '제공하기': 1, '위해': 1, '네트워크': 1, '기술이': 1, '최적화되어': 1, '게임': 1, ' 진행': 1, '오류': 1, '원격': 1, '지원': 1, '신청': 1, '제휴문의': 1, '텔레그램': 1, '궁금한': 1, '점이': 1, '있으세요': 1, '자주묻는질문': 1})
# [20088:22520:0522/225013.022:ERROR:ssl_client_socket_impl.cc(879)] handshake failed; returned -1, SSL error code 1, net_error -113
# [20088:22520:0522/225013.367:ERROR:ssl_client_socket_impl.cc(879)] handshake failed; returned -1, SSL error code 1, net_error -113
# kw : Counter({'입력해': 23, '주세요': 23, '가능합니다': 15, '사용하실': 9, '입력이': 9, '출금': 8, '접근에러': 8, '인증': 7, '비밀번호를': 7, '숫자': 7, '비밀번호는': 7, '까지만': 7, '비밀번호': 6, '입력': 6, '알뜰폰': 6, '정확하게': 6, '아이디': 5, '가입하기': 5, '연락처': 5, '인증번호': 5, '수': 5, '자': 5, '닉네임': 4, '국민은행': 4, '하나은행': 4, '신한 은행': 4, '기업은행': 4, '농협': 4, '신협': 4, '수협': 4, '우체국': 4, '카카오뱅크': 4, '새마을금고': 4, '도이치은행': 4, '광주은행': 4, '산업은행': 4, '경남은행': 4, '부산은행': 4, '대구은행': 4, '전북은행': 4, '제주은행': 4, '은행': 4, '제일은행': 4, '한국씨티은행': 4, '입력하신': 4, '없습니다': 4, '조합': 4, '한글': 4, '받으실': 4, '번호를': 4, '완료': 3, '확인': 3, '선택': 3, '전송': 3, '아이디를': 3, '연락처를': 3, '바랍니다': 3, '인증번호가': 3, '밀어서': 2, '보안해제': 2, '실패': 2, '코드': 2, '후': 2, '예금주': 2, '은행명': 2, '계좌번호': 2, '환영합니다': 2, '오신': 2, '아이디는': 2, '영문': 2, '글자만': 2, '닉네임을': 2, '정확히': 2, '정확한': 2, '입력해주시길': 2, '공백없이': 2, '영어와': 2, '숫자로만': 2, '계좌번호를': 2, '계좌번호는': 2, '숫자와': 2, '만을': 2, '사용해서': 2, '입력해주세요': 2, '예금주를': 2, '은행명을': 2, '닉네임은': 2, '자까지만': 2, '발송': 2, '되었습니다': 2, '핼프': 1, '로그인': 1, '잊으셨나요': 1, '회원': 1, '또는': 1, '문의': 1, '하기': 1, '계정이': 1, '없으신가요': 1, '평생주소': 1, '둘러': 1, '보기는': 1, '최소한의': 1, '정보': 1, '이용': 1, '통신사': 1, '가': 1, '입': 1, '하': 1, '기': 1, '정회원': 1, '접속': 1, '처음': 1, '회원님께': 1, '드리는': 1, '혜택을': 1, '확인하세요': 1, '오랜': 1, '기간': 1, '동안': 1, '신뢰와': 1, '보안을': 1, '최우선으로': 1, '운영되고': 1, '있으며': 1, '언제나': 1, '만족하실': 1, '있는': 1, '사이트가': 1, '될': 1, '것입니다': 1, '에': 1, '것을': 1, '가입': 1, '회원님의': 1, '추천인': 1, '코드를': 1, '잠금해제': 1, '로그인이': 1, '회원가입이': 1, '정상적으로': 1, '됐습니다': 1, '전화번호가': 1, '정확하지': 1, '않습니다': 1, '이동통신사업자에게': 1, '전달되었습니다': 1, '발송되었습니다': 1, '자리를': 1, '입력하여': 1, '주시기': 1, '전송을': 1, '실패하였습니다': 1})
# kw : Counter({'입력해': 5, '주세요': 5, '로그인': 5, '로그인이': 3, '되시지': 3, '않는다면': 3, '아이디': 3, '안전놀이터': 2, '아이디를': 2, '접근에러': 2, '화살표': 2, '이미지': 2, '퍼스트주소': 2, '회원가입': 2, '창': 2, '비밀번호': 2, '문의': 2, '프라임': 1, '평생': 1, '도메인': 1, '안내': 1, '프라임평생주소': 1, '프라임평생도메인': 1, '카지노첫충': 1, ' 프라임주소': 1, '에볼루션첫충': 1, '프라임도메인안내': 1, '안전메이저': 1, '메이저놀이터': 1, '메이저토토': 1, '메이저사이트': 1, '첫충': 1, '메이저': 1, '검증된놀이터': 1, '검증된사이트': 1, '모바일로': 1, '접속하셨습니다': 1, '모바일': 1, '전용': 1, '페이지로': 1, '이동합니다': 1, '비밀번호를': 1, '닉네임을': 1, '입력하여': 1, '주십시오': 1, '회원님의': 1, '연락처를': 1, '추천인': 1, '코드를': 1, '등업체': 1, '퍼스트에': 1, '오신걸': 1, '환영합니다': 1, '주소가': 1, '생각나지': 1, '않을때는': 1, '검색해주세요': 1, '남기기': 1, '추천': 1, '코드': 1, '입력': 1, '확인': 1, '또는': 1, '닉네임': 1, '연락처': 1, '하기': 1})
